doggydm/app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE (id > 9) ORDER BY "posts"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def index
  	@post = Post.first

SELECT  "posts".* FROM "posts" WHERE (id > 9) ORDER BY "posts"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
  def show
  	@post = Post.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE (id > 45) ORDER BY "posts"."id" ASC LIMIT ?  [["LIMIT", 1]]
UPDATE "posts" SET "likes" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["likes", 18], ["updated_at", "2017-09-21 05:18:18.469365"], ["id", 41]]
---
  def update
    @post = Post.find(params[:id])
    @post.likes = @post.likes+1
    @post.save

INSERT INTO "posts" ("description", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "likes", "names") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
  	@post = Post.new(permit_post)
    @post.user_id = current_user.id
  	if @post.save